In [ ]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series([10,20,30,40,50])
series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
my_dict={
    "name":['Alice',"None",None,"Abdelfattah" , None ],
    "Age":[24,15,34,23,23],
    "city": ["cairo", "alex" , None , "cairo" , "cairo"]
}
df = pd.DataFrame(my_dict)


df

          name  Age   city
0        Alice   24  cairo
1         None   15   alex
2         None   34   None
3  Abdelfattah   23  cairo
4         None   23  cairo

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     5 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [5]:
df.tail(2)

          name  Age   city
3  Abdelfattah   23  cairo
4         None   23  cairo

In [6]:
df.describe(include = 'all').T # for numerical

     count unique    top freq  mean       std   min   25%   50%   75%   max
name     3      3  Alice    1   NaN       NaN   NaN   NaN   NaN   NaN   NaN
Age    5.0    NaN    NaN  NaN  23.8  6.760178  15.0  23.0  23.0  24.0  34.0
city     4      2  cairo    3   NaN       NaN   NaN   NaN   NaN   NaN   NaN

In [7]:
df['Age'].head(2)

0    24
1    15
Name: Age, dtype: int64

In [8]:
df[df['Age']>=15]

          name  Age   city
0        Alice   24  cairo
1         None   15   alex
2         None   34   None
3  Abdelfattah   23  cairo
4         None   23  cairo

In [9]:
df[df['city']=='cairo']

          name  Age   city
0        Alice   24  cairo
3  Abdelfattah   23  cairo
4         None   23  cairo

In [10]:
df[['Age' , 'city']]

   Age   city
0   24  cairo
1   15   alex
2   34   None
3   23  cairo
4   23  cairo

In [11]:
df.loc[0:2,['Age' , 'city']]

   Age   city
0   24  cairo
1   15   alex
2   34   None

In [12]:

df['Salary']=[2000,1000,1400,1500,500]

df.head()

          name  Age   city  Salary
0        Alice   24  cairo    2000
1         None   15   alex    1000
2         None   34   None    1400
3  Abdelfattah   23  cairo    1500
4         None   23  cairo     500

In [13]:
df.drop('Salary',axis=1)

          name  Age   city
0        Alice   24  cairo
1         None   15   alex
2         None   34   None
3  Abdelfattah   23  cairo
4         None   23  cairo

In [14]:
df

          name  Age   city  Salary
0        Alice   24  cairo    2000
1         None   15   alex    1000
2         None   34   None    1400
3  Abdelfattah   23  cairo    1500
4         None   23  cairo     500

In [15]:
new_df = df.drop('Salary',axis=1)

In [16]:
df.drop(1,axis=0, inplace=True)

In [17]:
df

          name  Age   city  Salary
0        Alice   24  cairo    2000
2         None   34   None    1400
3  Abdelfattah   23  cairo    1500
4         None   23  cairo     500

In [18]:
df.reset_index()

   index         name  Age   city  Salary
0      0        Alice   24  cairo    2000
1      2         None   34   None    1400
2      3  Abdelfattah   23  cairo    1500
3      4         None   23  cairo     500

In [19]:
df.isnull().sum()

name      2
Age       0
city      1
Salary    0
dtype: int64

In [20]:
df['city'].fillna(df['city'].mode()[0],inplace=True)

/tmp/ipykernel_8576/2972405200.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['city'].fillna(df['city'].mode()[0],inplace=True)

In [21]:
df

          name  Age   city  Salary
0        Alice   24  cairo    2000
2         None   34  cairo    1400
3  Abdelfattah   23  cairo    1500
4         None   23  cairo     500

In [22]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

/tmp/ipykernel_8576/694922604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [23]:
df

          name  Age   city  Salary
0        Alice   24  cairo    2000
2         None   34  cairo    1400
3  Abdelfattah   23  cairo    1500
4         None   23  cairo     500

In [24]:
# df.dropna()

In [25]:
# grouping and aggregation

my_dict={
    "name":['Alice',"chaliry","abdo mo ","Abdelfattah" , "abdo khaled" ],
    "Age":[24,15,34,23,23],
    "city": ["cairo", "alex" , "cairo" , "cairo" , "cairo"],
    "Salary": [200,1452,123,258,1478]
}
df = pd.DataFrame(my_dict)


df

          name  Age   city  Salary
0        Alice   24  cairo     200
1      chaliry   15   alex    1452
2     abdo mo    34  cairo     123
3  Abdelfattah   23  cairo     258
4  abdo khaled   23  cairo    1478

In [26]:
x = df.groupby('city')['Age'].mean()

In [27]:
x

city
alex     15.0
cairo    26.0
Name: Age, dtype: float64

In [28]:
def double_salary(x):
    return x*2

df['Double Salary'] = df["Salary"].apply(double_salary)

df

          name  Age   city  Salary  Double Salary
0        Alice   24  cairo     200            400
1      chaliry   15   alex    1452           2904
2     abdo mo    34  cairo     123            246
3  Abdelfattah   23  cairo     258            516
4  abdo khaled   23  cairo    1478           2956

In [29]:
data = pd.read_csv("employees.csv")

data.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 608.0+ bytes

In [31]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,10.0,5.5,3.027650,1.0,3.25,5.5,7.75,10.0
Age,10.0,35.3,7.958922,26.0,29.25,33.0,40.25,50.0
Salary,10.0,68300.0,13106.826042,50000.0,57250.00,69000.0,74250.00,90000.0

In [32]:
data[data['Department']=="IT"]

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [33]:
avg =data.groupby('Department')['Salary'].mean()
avg

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

In [34]:
def newSalary(x):


    return x*1.05


data['new salary'] = data['Salary'].apply(newSalary)

data

   ID           Name Department  Age  Salary Joining_Date  new salary
0   1       John Doe         HR   28   50000   2020-05-21     52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12     78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15     89250.0
3   4    Alice White         IT   29   72000   2021-01-04     75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30     71400.0
5   6      Eva Green         HR   41   54000   2017-04-22     56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19     94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10     67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08     73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18     57750.0

In [35]:
sorted_data = data.sort_values('Age',ascending=False)
sorted_data

   ID           Name Department  Age  Salary Joining_Date  new salary
6   7     Mike Davis    Finance   50   90000   2016-08-19     94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15     89250.0
5   6      Eva Green         HR   41   54000   2017-04-22     56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08     73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12     78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30     71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18     57750.0
3   4    Alice White         IT   29   72000   2021-01-04     75600.0
0   1       John Doe         HR   28   50000   2020-05-21     52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10     67200.0

In [36]:
data['Department'].value_counts()

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [37]:
data['Joining_Date']=pd.to_datetime(data['Joining_Date'])

In [38]:
data.head()

   ID           Name Department  Age  Salary Joining_Date  new salary
0   1       John Doe         HR   28   50000   2020-05-21     52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12     78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15     89250.0
3   4    Alice White         IT   29   72000   2021-01-04     75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30     71400.0

In [39]:
data[data['Joining_Date'] > "2020-01-01"]

   ID          Name Department  Age  Salary Joining_Date  new salary
0   1      John Doe         HR   28   50000   2020-05-21     52500.0
3   4   Alice White         IT   29   72000   2021-01-04     75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10     67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08     73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18     57750.0

In [41]:
data.to_csv('new_data.csv')